banned_words = [
    "child",
    "porn",
    "pornography",
    "pussy",
    "vagina",
    "retard",
    "hitler",
    "allahu",
    "akbar",
    "penis"
]

banned_words_regex = [
    r"n+i+g+a+",
    r"n+i+g+e+r+",
    r"n+i+g+e+r+s+",
    r"f+a+g+o+t+",
    r"c+u+m+"
]

unicode_substitutions = {
    'a': ['a', '4', 'à', 'á', 'â', 'ä', 'ã', 'å', 'æ', 'α', 'а', '@'],
    'b': ['b', '8', 'β', 'Ь', 'в'],
    'c': ['c', 'ç', 'ć', 'č', '©', '¢'],
    'd': ['d', '∂', 'д', 'đ'],
    'e': ['e', '3', 'è', 'é', 'ê', 'ë', 'ε', 'є', 'е'],
    'f': ['f', 'ƒ', 'ғ'],
    'g': ['g', '9', 'ɡ', 'ġ', 'ğ'],
    'h': ['h', 'н', 'ħ', '#'],
    'i': ['i', '1', 'ì', 'í', 'î', 'ï', 'ι', 'ї', 'ı', '!'],
    'j': ['j', 'ј'],
    'k': ['k', 'κ', 'κ', 'к'],
    'l': ['l', '1', 'ł', 'ι', '|'],
    'm': ['m', 'м'],
    'n': ['n', 'η', 'ñ', 'ń', 'п'],
    'o': ['o', '0', 'ò', 'ó', 'ô', 'ö', 'õ', 'ø', 'ο', 'о', 'θ'],
    'p': ['p', 'ρ', 'р', 'þ'],
    'q': ['q', '9', 'φ'],
    'r': ['r', 'я', 'г'],
    's': ['s', '5', '$', 'ѕ', 'š'],
    't': ['t', '7', 'т', 'ť'],
    'u': ['u', 'ù', 'ú', 'û', 'ü', 'υ', 'μ', 'џ'],
    'v': ['v', 'ν', 'ѵ'],
    'w': ['w', 'ω', 'ш'],
    'x': ['x', '×', 'χ', 'х'],
    'y': ['y', '¥', 'γ', 'у', 'ү'],
    'z': ['z', '2', 'ž', 'ź', 'ż']
}
